#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    int d,m;
    string date[20]{"первое","второе","третье","четвёртое","пятое",
    "шестое","седьмое","восьмое","девятое","десятое",
    "одиннадцатое","двенадцатое","тринадцатое",
    "четырнадцатое","пятнадцатое","шестнадцатое","семнадцатое",
    "восемнадцатое","девятнадцатое","двадцатое"};
    string month[12] {"января","февраля","марта","апреля",
    "мая","июня","июля","августа","сентября","октября","ноября","декабря"};
    cin>>d>>m;
    if (d<=20)
    {
        cout<<date[d-1]<<" "<<month[m-1]<<endl;
    }
    else if ((d<30)&&(d>20)) 
    {
        cout<<"двадцать "<<date[d-1]<<" "<<month[m-1]<<endl;
    }
    else if (d==30)
    {
        cout<<"тридцатое "<<month[m-1]<<endl;
    }
    else
    {
        cout<<"тридцать "<<date[d-1]<<month[m-1]<<endl;
    }
    return 0;
}
