#include <iostream>
using namespace std;
int main()
{
    setlocale (LC_ALL, "Russian");
    int a,x1,x2,x3,x4;
    cin>>a;
    x1=a/100;
    x2=(a/10)%10;
    x3=a%10;
    string z1[9] {"сто","двести","триста","четыреста","пятьсот",
    "шестьсот","семьсот","восемьсот","девятьсот"};
    string z2_1[10] {"десять","одиннадцать","двенадцать","тринадцать",
    "четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать",
    "девятнадцать"};
    string z2_ost[10] {"","","двадцать","тридцать","сорок",
    "пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"};
    string z3[10] {"","один","два","три","четыре","пять","шесть",
    "семь","восемь","девять"};
    cout<<z1[x1-1]<<" ";
    if (x2==1) 
    {
        x4=a%100;
        cout<<z2_1[x4%10];
        return 0;
    }
    cout<<z2_ost[x2]<<" "<<z3[x3]<<endl;
    return 0;
}
